const caseData = [
  {
    "当事人": "上海华赣国际物流有限公司",
    "违法地址": "马陆镇龙盘路777号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海华赣国际物流有限公司对生产、储存、使用危险化学品的单位未将危险化学品储存在专用仓库内，或者未将剧毒化学品以及储存数量构成重大危险源的其他危险化学品在专用仓库内单独存放的行政处罚案",
    "立案日期": "2023.5.29",
    "lng": 121.3067807033481,
    "lat": 31.346814386794488
  },
  {
    "当事人": "上海显神物流有限公司",
    "违法地址": "上海市嘉定区浏翔公路6309号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海显神物流有限公司对生产、储存、使用危险化学品的单位未将危险化学品储存在专用仓库内，或者未将剧毒化学品以及储存数量构成重大危险源的其他危险化学品在专用仓库内单独存放的案",
    "立案日期": "2023.6.7",
    "lng": 121.30392391216526,
    "lat": 31.399715638448843
  },
  {
    "当事人": "上海鑫洋化工有限公司",
    "违法地址": "嘉定区汇旺路1833号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海鑫洋化工有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.7.7",
    "lng": 121.18214629350226,
    "lat": 31.389177498225312
  },
  {
    "当事人": "上海升本储运有限公司",
    "违法地址": "嘉定区嘉松北路3861号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海升本储运有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.7.11",
    "lng": 121.2184683784927,
    "lat": 31.33233771943892
  },
  {
    "当事人": "上海常兴货物运输代理有限公司",
    "违法地址": "嘉定区汇宝路638号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海常兴货物运输代理有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.7.13",
    "lng": 121.16980007240367,
    "lat": 31.391267081234314
  },
  {
    "当事人": "上海浩途供应链管理有限公司",
    "违法地址": "嘉定区育绿东路1188号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海浩途供应链管理有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.7.14",
    "lng": 121.3266838297188,
    "lat": 31.361352324665045
  },
  {
    "当事人": "上海智自磊物流有限公司",
    "违法地址": "嘉定区马陆镇丰功路958-2号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海智自磊物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.8.1",
    "lng": 121.29685164271575,
    "lat": 31.349734106025625
  },
  {
    "当事人": "上海朝旭物流有限公司",
    "违法地址": "嘉定区嘉新公路1157号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海朝旭物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.8.4",
    "lng": 121.29418852620088,
    "lat": 31.352599304744373
  },
  {
    "当事人": "董万东",
    "违法地址": "徐行镇果园路115号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "董万东未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.8.7",
    "lng": 121.30119827358689,
    "lat": 31.434347179070908
  },
  {
    "当事人": "上海延钰实业有限公司",
    "违法地址": "上海市嘉定区方园路1116号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海延钰实业有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.8.18",
    "lng": 121.23931023412136,
    "lat": 31.308174501391626
  },
  {
    "当事人": "上海创富物流有限公司",
    "违法地址": "嘉定区马陆镇丰功路988号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海创富物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.9.26",
    "lng": 121.29445361615687,
    "lat": 31.349548841111037
  },
  {
    "当事人": "上海嵘脉供应链管理有限公司",
    "违法地址": "嘉定区嘉新公路1157号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海嵘脉供应链管理有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.10.7",
    "lng": 121.29418852620088,
    "lat": 31.352599304744373
  },
  {
    "当事人": "上海蓝寅供应链管理有限公司",
    "违法地址": "嘉定区马陆镇丰功路800号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海蓝寅供应链管理有限公未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.10.11",
    "lng": 121.30088790903318,
    "lat": 31.352446271253996
  },
  {
    "当事人": "上海弘亿贸易有限公司",
    "违法地址": "嘉定区江桥镇宝园六路815号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海弘亿贸易有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.10.23",
    "lng": 121.26459385117465,
    "lat": 31.286057696269946
  },
  {
    "当事人": "歆钜新材料科技（上海）有限公司",
    "违法地址": "马陆镇丰功路859-2号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "歆钜新材料科技（上海）有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.10.24",
    "lng": 121.29937875577642,
    "lat": 31.350350805014894
  },
  {
    "当事人": "上海特零能源科技有限公司",
    "违法地址": "安亭镇陇南路6846号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海特零能源科技有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2023.11.3",
    "lng": 121.33192068135033,
    "lat": 31.278268699955163
  },
  {
    "当事人": "罗会霞",
    "违法地址": "嘉定区马陆镇宝安公路2915号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "罗会霞未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.1.2",
    "lng": 121.30478520748822,
    "lat": 31.341379857105252
  },
  {
    "当事人": "上海欧利斯特化工科技有限公司",
    "违法地址": "嘉定区马陆镇宝安公路2915号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海欧利斯特化工科技有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.1.2",
    "lng": 121.30478520748822,
    "lat": 31.341379857105252
  },
  {
    "当事人": "上海同试化工有限公司",
    "违法地址": "嘉定区马陆镇宝安公路2915号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海同试化工有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.1.2",
    "lng": 121.30478520748822,
    "lat": 31.341379857105252
  },
  {
    "当事人": "上海丹捷国际物流有限公司",
    "违法地址": "嘉定区马陆镇宝安公路2915号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海丹捷国际物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.1.2",
    "lng": 121.30478520748822,
    "lat": 31.341379857105252
  },
  {
    "当事人": "上海坚辰五金机电有限公司",
    "违法地址": "上海市嘉定区安亭镇金浩路76号1层",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海坚辰五金机电有限公司未将危险化学品储存在专用仓库内案（上海坚辰五金机电有限公司储存危险物品，未建立专门的安全管理制度、未采取可靠的安全措施案）",
    "立案日期": "2024.1.5",
    "lng": 121.23784446902074,
    "lat": 31.31790962739617
  },
  {
    "当事人": "上海宝中宝胶粘制品有限公司",
    "违法地址": "嘉定区惠平路1218号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海宝中宝胶粘制品有限公司未将危险化学品储存在专用仓库内案（上海宝中宝胶粘制品有限公司使用危险物品，未采取可靠的安全措施案）",
    "立案日期": "2024.2.9",
    "lng": 121.28675441929195,
    "lat": 31.312237168351245
  },
  {
    "当事人": "上海安御物流有限公司",
    "违法地址": "嘉定区马陆李宝路605号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海安御物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.2.23",
    "lng": 121.34018401407552,
    "lat": 31.35146361293527
  },
  {
    "当事人": "上海恒邦供应链管理有限公司",
    "违法地址": "嘉定区徐行镇果园路115号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海恒邦供应链管理有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.3.13",
    "lng": 121.30119827358689,
    "lat": 31.434347179070908
  },
  {
    "当事人": "上海凌翰大件物流有限公司",
    "违法地址": "嘉定区马陆镇思诚路1385号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海凌翰大件物流有限公司未将危险化学品储存在专用仓库案",
    "立案日期": "2024.3.19",
    "lng": 121.31598025007577,
    "lat": 31.343314458029102
  },
  {
    "当事人": "上海君磊物流有限公司",
    "违法地址": "马陆镇嘉新公路768号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海君磊物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.3.19",
    "lng": 121.28192836277015,
    "lat": 31.366519443269766
  },
  {
    "当事人": "孟佳拉（上海）供应链有限公司",
    "违法地址": "马陆镇励学路1288号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "孟佳拉（上海）供应链有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.3.21",
    "lng": 121.30880772973136,
    "lat": 31.370453232685247
  },
  {
    "当事人": "上海双吉仓储有限公司",
    "违法地址": "嘉定区育绿东路1号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海双吉仓储有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.3.28",
    "lng": 121.33276023767996,
    "lat": 31.362999750177966
  },
  {
    "当事人": "上海佳飞国际物流有限公司",
    "违法地址": "嘉定区宝钱公路3888号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海佳飞国际物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.3.28",
    "lng": 121.18577329182934,
    "lat": 31.410462845395344
  },
  {
    "当事人": "上海余晖供应链管理有限公司",
    "违法地址": "南翔镇顺达路299弄",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海余晖供应链管理有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.4.25",
    "lng": 121.34002178010041,
    "lat": 31.328122392110792
  },
  {
    "当事人": "上海森贝物流有限公司",
    "违法地址": "嘉定区丰登路 991 号 4 号棚",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海森贝物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.4.28",
    "lng": 121.29583017952037,
    "lat": 31.364589486997804
  },
  {
    "当事人": "宣城市锦卓物流有限责任公司",
    "违法地址": "嘉定区丰登路 991 号 3号棚",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "宣城市锦卓物流有限责任公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.4.28",
    "lng": 121.29583017952037,
    "lat": 31.364589486997804
  },
  {
    "当事人": "上海格常建筑工程服务中心",
    "违法地址": "灯塔村835号附近空地",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海格常建筑工程服务中心未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.4.29",
    "lng": 121.17291198235135,
    "lat": 31.44912643115179
  },
  {
    "当事人": "上海勤钰化工科技有限公司",
    "违法地址": "嘉定区嘉定镇清河路48号1幢3层301室",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "上海勤钰化工科技有限公司未按照规定申请变更危险化学品经营许可证案",
    "立案日期": "2024.4.29",
    "lng": 121.25442251754626,
    "lat": 31.39051348044335
  },
  {
    "当事人": "上海沪辽物流有限公司",
    "违法地址": "嘉定区美剑路105号东侧仓库",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海沪辽物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.4.30",
    "lng": 121.27259505835202,
    "lat": 31.3801553396772
  },
  {
    "当事人": "长芬供应链管理（上海）有限公司",
    "违法地址": "嘉定区美剑路105号西侧仓库",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "长芬供应链管理（上海）有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.4.30",
    "lng": 121.27259505835202,
    "lat": 31.3801553396772
  },
  {
    "当事人": "上海轩绮物流有限公司",
    "违法地址": "嘉定区浏翔公路3857号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海轩绮物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.5.11",
    "lng": 121.30072459709147,
    "lat": 31.406588689946272
  },
  {
    "当事人": "徐荣荣",
    "违法地址": "嘉定区春归路176号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "徐荣荣未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.5.12",
    "lng": 121.25363102056143,
    "lat": 31.293074913249956
  },
  {
    "当事人": "上海喀润实业有限公司",
    "违法地址": "嘉定工业区宝钱公路2825号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海喀润实业有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.5.18",
    "lng": 121.22625219573666,
    "lat": 31.432566679755137
  },
  {
    "当事人": "上海全力实业有限公司",
    "违法地址": "嘉定区安亭镇春意路277号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海全力实业有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.5.30",
    "lng": 121.24698993775671,
    "lat": 31.28350685320201
  },
  {
    "当事人": "淮安巨鼎供应链管理有限公司",
    "违法地址": "上海市嘉定区前曹公路409号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "淮安巨鼎供应链管理有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.5.31",
    "lng": 121.31232863817772,
    "lat": 31.44575889489579
  },
  {
    "当事人": "阜新蓝盟物流有限公司",
    "违法地址": "嘉定区宝钱公路963弄",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "阜新蓝盟物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.6.7",
    "lng": 121.28912010685248,
    "lat": 31.452246713098504
  },
  {
    "当事人": "上海种良油脂化工有限公司",
    "违法地址": "上海市嘉定区黄渡镇春归路792号",
    "本案案由": "危险化学品非法生产",
    "违法违规行为基本情况": "上海种良油脂化工有限公司未取得安全生产许可证擅自进行生产危险化学品案",
    "立案日期": "2024.7.2",
    "lng": 121.23819597596678,
    "lat": 31.292975242976425
  },
  {
    "当事人": "上海率土涂料有限公司",
    "违法地址": "嘉定区安亭镇泰涛路298号9号仓库",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海率土涂料有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.6.7",
    "lng": 121.25461206000887,
    "lat": 31.317290245708417
  },
  {
    "当事人": "上海衡成供应链管理有限公司",
    "违法地址": "嘉定区陈翔公路1086号西侧大棚",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海衡成供应链管理有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.6.19",
    "lng": 121.34262587794329,
    "lat": 31.323028025983508
  },
  {
    "当事人": "上海雄伟运输有限公司",
    "违法地址": "嘉定区马陆镇浏翔公路3155号1幢",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海雄伟运输有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.6.20",
    "lng": 121.30798209713714,
    "lat": 31.386771664582938
  },
  {
    "当事人": "萃特贸易（上海）有限公司",
    "违法地址": "嘉定区曹安公路4671号1幢8层C区812室",
    "本案案由": "其他",
    "违法违规行为基本情况": "萃特贸易（上海）有限公司不办理危险化学品登记案",
    "立案日期": "2024.6.27",
    "lng": 121.2248229916703,
    "lat": 31.28224880355561
  },
  {
    "当事人": "上海麓馨实业有限公司",
    "违法地址": "嘉定区顺达路98弄61号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海麓馨实业有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.7.14",
    "lng": 121.34606369312998,
    "lat": 31.330116877054824
  },
  {
    "当事人": "上海明鹏物流有限公司",
    "违法地址": "华亭镇华业路500号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海明鹏物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.9.30",
    "lng": 121.26560399572062,
    "lat": 31.463656612444648
  },
  {
    "当事人": "上海杰耐化工科技有限公司",
    "违法地址": "嘉前路688弄9号楼",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海杰耐化工科技有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.10.18",
    "lng": 121.29219509644368,
    "lat": 31.30534056436828
  },
  {
    "当事人": "展羽物流（上海）有限公司",
    "违法地址": "马陆镇丰茂路99号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "展羽物流（上海）有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.10.18",
    "lng": 121.31227482967766,
    "lat": 31.359297993308928
  },
  {
    "当事人": "上海途辉供应链管理有限公司",
    "违法地址": "马陆镇育绿东路718弄2、3库",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海途辉供应链管理有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.10.25",
    "lng": 121.3266838297188,
    "lat": 31.361352324665045
  },
  {
    "当事人": "上海群驰国际物流有限公司",
    "违法地址": "徐行镇宝钱公路339号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海群驰国际物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.10.25",
    "lng": 121.3220821699134,
    "lat": 31.458075358261784
  },
  {
    "当事人": "上海昇冠供应链有限公司",
    "违法地址": "马陆镇浏翔公路2088号",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "上海昇冠供应链有限公司未取得危险化学品经营许可证经营危险化学品案",
    "立案日期": "2024.11.14",
    "lng": 121.32193062577387,
    "lat": 31.35319771338894
  },
  {
    "当事人": "中涂化工（上海）有限公司",
    "违法地址": "上海市嘉定区嘉松北路 4677 号",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "中涂化工（上海）有限公司未取得危险化学品经营许可证从事危险化学品经营案",
    "立案日期": "2024.11.22",
    "lng": 121.2260796312482,
    "lat": 31.32240567062128
  },
  {
    "当事人": "上海宝来特气体有限公司",
    "违法地址": "嘉定工业区嘉唐公路806号",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "上海宝来特气体有限公司未取得危险化学品经营许可证从事危险化学品经营案",
    "立案日期": "2024.12.10",
    "lng": 121.23653878196197,
    "lat": 31.42024128357736
  },
  {
    "当事人": "上海佳昱物流有限公司",
    "违法地址": "安亭镇塔山路1382号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海佳昱物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2024.12.13",
    "lng": 121.18449958444675,
    "lat": 31.310993620622426
  },
  {
    "当事人": "上海悦华物流有限公司",
    "违法地址": "安亭镇园民路1285号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海悦华物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.1.10",
    "lng": 121.184558153966,
    "lat": 31.332951063596045
  },
  {
    "当事人": "舟山亿文石油化工有限公司",
    "违法地址": "安亭镇于田路555号",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "舟山亿文石油化工有限公司未取得危险化学品经营许可证从事危险化学品（柴油）经营案",
    "立案日期": "2025.1.13",
    "lng": 121.19274836462267,
    "lat": 31.306256988848254
  },
  {
    "当事人": "上海晟锦辉化工有限公司",
    "违法地址": "外冈镇新旺路1号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海晟锦辉化工有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.1.14",
    "lng": 121.16949878073562,
    "lat": 31.36927258916911
  },
  {
    "当事人": "上海祥乐田村电化工业有限公司",
    "违法地址": "上海市嘉定区翔江公路555号",
    "本案案由": "危险化学品非法生产",
    "违法违规行为基本情况": "上海祥乐田村电化工业有限公司未取得安全生产许可证生产危险化学品案",
    "立案日期": "2025.2.13",
    "lng": 121.29732900226375,
    "lat": 31.30053985248171
  },
  {
    "当事人": "重庆韩拓科技有限公司",
    "违法地址": "嘉定区马陆镇思诚路 1395 号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "重庆韩拓科技有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.2.28",
    "lng": 121.3165591181464,
    "lat": 31.34370243740389
  },
  {
    "当事人": "易启运供应链（上海）有限公司",
    "违法地址": "嘉定区徐行镇前曹公路409号南大棚2档",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "易启运供应链(上海）有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.3.7",
    "lng": 121.31232863817772,
    "lat": 31.44575889489579
  },
  {
    "当事人": "上海宇钰化工有限公司",
    "违法地址": "上海市嘉定区外冈镇汇旺路1833号",
    "本案案由": "其他",
    "违法违规行为基本情况": "上海宇钰化工有限公司经营没有化学品安全技术说明书或者化学品安全标签的危险化学品案",
    "立案日期": "2025.4.24",
    "lng": 121.18214629350226,
    "lat": 31.389177498225312
  },
  {
    "当事人": "上海鑫洋化工有限公司",
    "违法地址": "上海市嘉定区外冈镇汇旺路1833号",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "上海鑫洋化工有限公司未取得危险化学品经营许可证从事危险化学品（仓储）经营案",
    "立案日期": "2025.4.24",
    "lng": 121.18214629350226,
    "lat": 31.389177498225312
  },
  {
    "当事人": "赵德成",
    "违法地址": "外冈镇望安路 615 号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "赵德成未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.4.27",
    "lng": 121.15452312957879,
    "lat": 31.352030496879088
  },
  {
    "当事人": "上海申楚物流有限公司",
    "违法地址": "嘉定区科盛路 1050 号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海申楚物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.5.2",
    "lng": 121.33761369251981,
    "lat": 31.340335012485994
  },
  {
    "当事人": "上海斯幕威化工有限公司",
    "违法地址": "嘉定区静唐路283号1号楼东起第3个仓库",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海斯幕威化工有限公司未将危险化学品储存在专用仓库内等案",
    "立案日期": "2025.5.8",
    "lng": 121.34338925796567,
    "lat": 31.324792346147266
  },
  {
    "当事人": "上海松龙物流有限公司",
    "违法地址": "嘉定区安亭镇园大路58号",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "上海松龙物流有限公司未取得危险化学品经营许可证从事危险化学品（仓储）经营案",
    "立案日期": "2025.5.12",
    "lng": 121.20141081448594,
    "lat": 31.318863178709453
  },
  {
    "当事人": "上海蓝寅供应链管理有限公司",
    "违法地址": "嘉定区丰功路800号",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "上海蓝寅供应链管理有限公司未取得危险化学品经营许可证从事危险化学品经营案",
    "立案日期": "2025.5.12",
    "lng": 121.30088790903318,
    "lat": 31.352446271253996
  },
  {
    "当事人": "酒泉群驰物流有限公司",
    "违法地址": "徐行镇宝钱公路339号",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "酒泉群驰物流有限公司未取得危险化学品经营许可证从事危险化学品经营案",
    "立案日期": "2025.5.14",
    "lng": 121.3220821699134,
    "lat": 31.458075358261784
  },
  {
    "当事人": "周口市鑫利特种货物运输有限公司",
    "违法地址": "嘉定区安亭镇园大路58号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "周口市鑫利特种货物运输有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.5.14",
    "lng": 121.20141081448594,
    "lat": 31.318863178709453
  },
  {
    "当事人": "上海展陶贸易有限公司",
    "违法地址": "嘉定区娄陆公路590号1号仓库",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海展陶贸易有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.5.15",
    "lng": 121.21101693428744,
    "lat": 31.455095276519724
  },
  {
    "当事人": "湖北和兴供应链有限公司",
    "违法地址": "区徐行镇嘉罗公路1897号30号库",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "湖北和兴供应链有限公司未取得危险化学品经营许可证从事危险化学品经营案",
    "立案日期": "2025.5.21",
    "lng": 121.29370200393667,
    "lat": 31.4080352954658
  },
  {
    "当事人": "上海捷昶工贸有限公司",
    "违法地址": "嘉定区娄陆公路590号1号仓库",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "上海捷昶工贸有限公司未经许可进行仓储经营危险化学品案",
    "立案日期": "2025.5.12",
    "lng": 121.21101693428744,
    "lat": 31.455095276519724
  },
  {
    "当事人": "上海金佑通物流有限公司",
    "违法地址": "宝钱公路 419 号",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "上海金佑通物流有限公司未取得危险化学品经营许可证从事危险化学品（仓储）经营案",
    "立案日期": "2025.6.10",
    "lng": 121.21350281512521,
    "lat": 31.427254634622273
  },
  {
    "当事人": "上海原晋化工有限公司",
    "违法地址": "前曹公路409号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海原晋化工有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.6.10",
    "lng": 121.31232863817772,
    "lat": 31.44575889489579
  },
  {
    "当事人": "上海途辉供应链管理有限公司",
    "违法地址": "马陆镇丰年路 960 号",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "上海途辉供应链管理有限公司对危险化学品经营许可证管理的行政处罚案",
    "立案日期": "2025.6.11",
    "lng": 121.3009076717544,
    "lat": 31.362825612103816
  },
  {
    "当事人": "上海栗延实业有限公司",
    "违法地址": "大安路1928号6号仓库",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海栗延实业有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.7.8",
    "lng": 121.3048320092053,
    "lat": 31.441647908976147
  },
  {
    "当事人": "上海忠平物流有限公司",
    "违法地址": "浏翔公路3851弄58号东侧停车场",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海忠平物流有限公司对危险化学品储存在专用仓库内的行政处罚案",
    "立案日期": "2025.7.9",
    "lng": 121.29791451779516,
    "lat": 31.405665162122727
  },
  {
    "当事人": "上海雅浩建筑装饰工程有限公司",
    "违法地址": "曹安公路3807号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海雅浩建筑装饰工程有限公司对危险化学品储存在专用仓库内的行政处罚案",
    "立案日期": "2025.7.11",
    "lng": 121.2867240565657,
    "lat": 31.27514173146834
  },
  {
    "当事人": "宝马弹簧（上海）有限公司",
    "违法地址": "马陆镇申霞路358号2号厂房",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "宝马弹簧（上海）有限公司对危险化学品储存在专用仓库内的行政处罚案",
    "立案日期": "2025.7.24",
    "lng": 121.28297255309495,
    "lat": 31.374184991321204
  },
  {
    "当事人": "上海众芮环保科技有限公司",
    "违法地址": "华亭镇浏翔公路6688号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海众芮环保科技有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.8.4",
    "lng": 121.2921923116966,
    "lat": 31.46641519684866
  },
  {
    "当事人": "上海雷尔印刷有限公司",
    "违法地址": "南翔镇惠平路77号8号楼",
    "本案案由": "其他",
    "违法违规行为基本情况": "上海雷尔印刷有限公司使用危险化学品未建立专门的安全管理制度且未采取可靠的安全措施案",
    "立案日期": "2025.8.6",
    "lng": 121.29615204238459,
    "lat": 31.294841882899
  },
  {
    "当事人": "高瓴（天津）供应链管理有限公司",
    "违法地址": "徐行镇嘉罗公路 1897 号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "高瓴（天津）供应链管理有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.8.9",
    "lng": 121.28952488331528,
    "lat": 31.406377341113245
  },
  {
    "当事人": "上海高麦新材料科技有限公司",
    "违法地址": "宝钱公路419号3号仓库",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海高麦新材料科技有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.8.13",
    "lng": 121.31429826283889,
    "lat": 31.455801223707326
  },
  {
    "当事人": "上海韵美物流有限公司",
    "违法地址": "马陆镇丰登路 991 号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海韵美物流有限公司对危险化学品储存在专用仓库内的行政处罚案",
    "立案日期": "2025.8.22",
    "lng": 121.29583017952037,
    "lat": 31.364589486997804
  },
  {
    "当事人": "上海衡成供应链管理有限公司",
    "违法地址": "南翔镇陈翔公路1086号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海衡成供应链管理有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.8.31",
    "lng": 121.34262587794329,
    "lat": 31.323028025983508
  },
  {
    "当事人": "湖州景诚物流有限公司",
    "违法地址": "安亭镇宝安公路6288号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "湖州景诚物流有限公司未将危险化学品（柴油）储存在专用场地内案",
    "立案日期": "2025.9.26",
    "lng": 121.24965970173237,
    "lat": 31.325814384161358
  },
  {
    "当事人": "上海群宝建材有限公司",
    "违法地址": "南翔镇亚钢路33弄39号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海群宝建材有限公司对危险化学品储存在专用仓库内的行政处罚案",
    "立案日期": "2025.9.30",
    "lng": 121.2945602450209,
    "lat": 31.321676807777074
  },
  {
    "当事人": "上海岁峰国际物流有限公司",
    "违法地址": "马陆镇敬学路 150 号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海岁峰国际物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2025.10.20",
    "lng": 121.31233995682713,
    "lat": 31.34234704693411
  },
  {
    "当事人": "上海松龙物流有限公司",
    "违法地址": "安亭镇园大路 58 号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海松龙物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2026.1.20",
    "lng": 121.1979783891323,
    "lat": 31.32390810803602
  },
  {
    "当事人": "上海霍富物流有限公司",
    "违法地址": "华亭镇华博路851号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海霍富物流有限公司未将危险化学品储存在专用仓库内案",
    "立案日期": "2026.3.2",
    "lng": 121.26037199493885,
    "lat": 31.455865526473122
  },
  {
    "当事人": "福斯润滑油（中国）有限公司",
    "违法地址": "南翔镇惠申路105号",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "福斯润滑油（中国）有限公司未经许可从事危险化学品仓储经营案",
    "立案日期": "2026.3.12",
    "lng": 121.29400688882676,
    "lat": 31.308969956713323
  },
  {
    "当事人": "上海宏跃物流有限公司",
    "违法地址": "马陆镇彭封路 15 号",
    "本案案由": "危险化学品非法储存",
    "违法违规行为基本情况": "上海宏跃物流有限公司未将危险化学品储存在专用仓库内的行政处罚案",
    "立案日期": "2026.4.21",
    "lng": 121.29596717111063,
    "lat": 31.35496007466265
  },
  {
    "当事人": "上海光熔基科新材料有限公司",
    "违法地址": "霜竹公路5001号8幢3层",
    "本案案由": "危险化学品非法生产",
    "违法违规行为基本情况": "上海光熔基科新材料有限公司未取得安全生产许可证擅自进行危险化学品生产等案",
    "立案日期": "2026.5.11",
    "lng": 121.18076200471138,
    "lat": 31.447062948823515
  },
  {
    "当事人": "上海哲昊物流有限公司",
    "违法地址": "徐行镇曹新公路118号",
    "本案案由": "危险化学品非法经营",
    "违法违规行为基本情况": "上海哲昊物流有限公司未取得危险化学品经营许可证从事危险化学品（仓储）经营案",
    "立案日期": "2026.5.19",
    "lng": 121.33881616427547,
    "lat": 31.442543120631733
  }
];
